# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 5  # number of classes
nc_grid: 3  # number of grid classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [53,65, 206,48, 49,228]  # P3/8
  - [52,621, 496,73, 80,576]  # P4/16
  - [555,141, 201,543, 405,577]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [[-1, 1, vit_base,    [0.4]],  # 0
   [-1, 1, SelectLayer, [768, 0]],  # 1
  ]

# YOLOv5 v6.0 head
head:
  [[1, 1, ConvTranspose2d, [384, 2]],
   [-1, 6, C3, [384, True, 1, 0.5, 2]], # 3 P3/8
   [1, 6, C3, [768, True, 1, 0.5, 3]], # 4 P4/16
   [1, 1, nn.MaxPool2d, [2, 2]],
   [-1, 6, C3, [768, True, 1, 0.5, 4]], # 6 P5/32
   [-2, 6, C3, [768, True, 1, 0.5, 1]], # 7 grid/32
   [[3, 4, 6, -1], 1, PatchClassify, [nc, anchors, nc_grid]],  # Detect(P3, P4, P5)
  ]
