# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 5  # number of classes
nc_grid: 3  # number of grid classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [53,65, 206,48, 49,228]  # P3/8
  - [52,621, 496,73, 80,576]  # P4/16
  - [555,141, 201,543, 405,577]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [[-1, 1, swin_small,  [0.2]], # 0-P1/2
   [-1, 1, SelectLayer, [256, 0]], # 1-P3/8
   [0,  1, SelectLayer, [512, 1]], # 2-P4/16
   [0,  1, SelectLayer, [1024, 2]],  # 3-P5/32
   [-1, 1, SPPF,        [1024, 5]],  # 4-SPP
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 8

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 12 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 9], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 15 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 5], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 18 (P5/32-large)

   [ 1,1,Conv,[ 256,3,2 ] ],
   [ -1,1,C3,[ 256,False ] ],
   [ 2,1,Conv,[ 256,1,1 ] ],
   [ [ -1,20 ],1,Concat,[ 1 ] ],
   [ -1,1,Conv,[ 512,3,2 ] ],
   [ -1,1,C3,[ 512,False ] ],
   [ 3,1,Conv,[ 512,1,1 ] ],     #28(16,medium)
   [ [ -1,24 ],1,Concat,[ 1 ] ],
   [ -1,1,C3,[ 1024,False ] ],   #32(32,large)

   [[12, 15, 18, 27], 1, PatchClassify, [nc, anchors, nc_grid]],  # Detect(P3, P4, P5)
  ]